app/views/listes/index.html.erb

SELECT "partages".* FROM "partages" WHERE "partages"."liste_id" IN (2, 3, 4, 6, 7, 8, 9, 10)
---
        <%=link_to l.nom_liste, liste_path(id: l.id)%></td>
        <td>Partagé avec : <%= l.partages.to_a.size > 0 ? l.partages.to_a.map{|p| p.user.name.capitalize}.join(", ") : "personne" %></td>