app/controllers/application_controller.rb

  def root
    @liste = Liste.owner_and_shared_with(session[:user_id]).first
---
SELECT "listes".* FROM "listes" WHERE "listes"."user_id" = ?  [["user_id", 1]]