app/controllers/articles_controller.rb

SELECT  "listes".* FROM "listes" WHERE "listes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "listes".* FROM "listes"
SELECT "articles".* FROM "articles" WHERE "articles"."liste_id" = ?  [["liste_id", 1]]
---
  def index
    @liste = Liste.find(params[:liste_id])
    @listes = Liste.all
    @articles = @liste.article.all

SELECT  "listes".* FROM "listes" WHERE "listes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("article", "ajoutepar", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article", "pain"], ["ajoutepar", "francis"], ["created_at", "2018-03-11 19:00:15.961515"], ["updated_at", "2018-03-11 19:00:15.961515"]]
---
  def create
    @liste = Liste.find(params[:liste_id])
    @article = @liste.article.build
    @article.article = params[:article][:article]


    respond_to do |format|
      if @article.save

UPDATE "articles" SET "article" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["article", "fromages"], ["updated_at", "2018-03-11 19:32:26.341962"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)

SELECT  "listes".* FROM "listes" WHERE "listes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."liste_id" = ? AND "articles"."id" = ? LIMIT ?  [["liste_id", 1], ["id", nil], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 3]]
---
  def destroy
    liste = Liste.find(params[:liste_id])
    @article = liste.article.find(params[:id])
    @article.delete

SELECT  "listes".* FROM "listes" WHERE "listes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."liste_id" = ? ORDER BY "articles"."created_at" ASC  [["liste_id", 3]]
DELETE FROM "articles" WHERE "articles"."liste_id" = ?  [["liste_id", 1]]
---
  def destroy_all
    @liste = Liste.find(params[:liste_id])
    @articles = @liste.article.all
    @articles.delete_all