app/controllers/articles_controller.rb

SELECT "listes".* FROM "listes" WHERE "listes"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "listes" WHERE "listes"."user_id" = ?  [["user_id", 10]]
---
  def index
    @listes = Liste.references(:article).where(user_id: session[:user_id])
    @current_id = params[:liste_id] == "0" ? @listes[0].id.to_s : params[:liste_id]


    @listes.each do |l|
      if l.id.to_s == @current_id
        @liste = l
        @articles = @liste.article
      end
    end

    if (@listes.size == 0 || !@liste)