app/controllers/listes_controller.rb

  def index
    @listes = Liste.all
---
SELECT "listes".* FROM "listes"