app/controllers/listes_controller.rb

SELECT "listes".* FROM "listes" WHERE "listes"."user_id" = ?  [["user_id", 1]]
---
  def index
    @listes = Liste.where(user_id: session[:user_id])

INSERT INTO "listes" ("utilisateur", "nom_liste", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["utilisateur", "Default"], ["nom_liste", "Test"], ["created_at", "2018-04-07 14:56:14.146302"], ["updated_at", "2018-04-07 14:56:14.146302"]]
SELECT  1 AS one FROM "listes" WHERE "listes"."nom_liste" = ? AND "listes"."nom_liste" = ? AND "listes"."user_id" = ? LIMIT ?  [["nom_liste", "Test avec user"], ["nom_liste", "Test avec user"], ["user_id", 1], ["LIMIT", 1]]
---
  def create
    @liste = Liste.new
    @liste.user_id = session[:user_id]
    @liste.nom_liste = params[:liste][:nom_liste].capitalize
    if @liste.save
      redirect_to liste_articles_path(liste_id: @liste.id)
    else
      if @liste.errors["nom_liste"][0].include? 'is too long'

SELECT "listes".* FROM "listes" WHERE "listes"."user_id" = ?  [["user_id", 1]]
SELECT  "listes".* FROM "listes" ORDER BY "listes"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "listes" WHERE "listes"."user_id" = ?  [["user_id", 1]]
---
  def root
    if !session[:user_id]
      redirect_to log_in_path

    else
      @listes = Liste.where(user_id: session[:user_id])
      if @listes.size > 0

SELECT  "listes".* FROM "listes" WHERE "listes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "listes" WHERE "listes"."id" = ?  [["id", 7]]
---
  def destroy
    @liste = Liste.find(params[:id])
    @liste.destroy