app/controllers/partages_controller.rb

  def new
    @partage = Partage.new
    @listes = Liste.where(user_id: session[:user_id])
---
SELECT "listes".* FROM "listes" WHERE "listes"."user_id" = ?  [["user_id", 1]]

  def create
    @users =  User.where("lower(name) = lower(?) AND id != ?", "#{params[:partage][:destinataire_name]}","#{session[:user_id].to_i}").to_a
    if @users.size != 1
      @users = User.where("lower(name) LIKE lower(?) AND id != ?", "%#{params[:partage][:destinataire_name]}%","#{session[:user_id].to_i}").to_a
    end

    @partage = Partage.new
    @partage.found = @users.map{|u| u.name}
    @partage.proprietaire_id = session[:user_id]
    @partage.destinataire_id = @users[0].id if @partage.found.size == 1

    @partage.liste_id = params[:partage][:liste_id]
    if @partage.save
        redirect_to "/"
    else
        @listes = Liste.where(user_id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "michel"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" WHERE (name LIKE '%mich%')
INSERT INTO "partages" ("proprietaire_id", "destinataire_id", "created_at", "updated_at", "liste_id") VALUES (?, ?, ?, ?, ?)  [["proprietaire_id", 1], ["destinataire_id", 5], ["created_at", "2018-04-29 16:58:52.531883"], ["updated_at", "2018-04-29 16:58:52.531883"], ["liste_id", 2]]
SELECT "listes".* FROM "listes" WHERE "listes"."user_id" = ?  [["user_id", 1]]

  def destroy
    @partage = Partage.find(params[:id])
    @partage.destroy
---
SELECT  "partages".* FROM "partages" WHERE "partages"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "partages" WHERE "partages"."id" = ?  [["id", 5]]